In [8]:
!aws s3 ls \
    s3://airetail/retail_db_json/daily_product_revenue/

2022-07-21 05:40:51          0 _SUCCESS
2022-07-21 05:40:51    1418230 part-00000-cbee590f-73d2-47c9-b2ae-60fd25352e43-c000.json
2022-07-21 05:40:51    1418855 part-00001-cbee590f-73d2-47c9-b2ae-60fd25352e43-c000.json
2022-07-21 05:40:51    1448602 part-00002-cbee590f-73d2-47c9-b2ae-60fd25352e43-c000.json

In [9]:
import pandas as pd

In [10]:
df = pd.read_json(
    's3://airetail/retail_db_json/daily_product_revenue/part-00000-cbee590f-73d2-47c9-b2ae-60fd25352e43-c000.json',
    lines=True
)

In [11]:
df

                  order_date     order_status  order_item_product_id  revenue
0      2013-07-25 00:00:00.0         COMPLETE                    191  3899.61
1      2013-07-25 00:00:00.0         COMPLETE                   1004  3199.84
2      2013-07-25 00:00:00.0         COMPLETE                    957  2999.80
3      2013-07-25 00:00:00.0  PENDING_PAYMENT                   1073  2599.87
4      2013-07-25 00:00:00.0           CLOSED                   1004  2399.88
...                      ...              ...                    ...      ...
12702  2013-11-21 00:00:00.0          ON_HOLD                    666   109.99
12703  2013-11-21 00:00:00.0  SUSPECTED_FRAUD                    677    99.99
12704  2013-11-21 00:00:00.0  PENDING_PAYMENT                    886    99.96
12705  2013-11-21 00:00:00.0         COMPLETE                    905    99.96
12706  2013-11-21 00:00:00.0       PROCESSING                    905    99.96

[12707 rows x 4 columns]

Run these commands to setup database and tables in Redshift Serverless Namespace/Workgroup. 

```sql
DROP DATABASE retail_dm;
CREATE DATABASE retail_dm;
CREATE USER retail_user WITH PASSWORD 'Itversity123';
GRANT ALL ON DATABASE retail_dm TO retail_user;
```

Let us create **daily_product_revenue** table in **retail_dm** database. If you are using Redshift Query Editor to run commands to create tables make sure to choose appropriate database from the database drop down.

```sql
DROP TABLE IF EXISTS daily_product_revenue;

CREATE TABLE daily_product_revenue (
    order_date VARCHAR DISTKEY,
    order_status VARCHAR,
    order_item_product_id INT,
    revenue FLOAT
);

ALTER TABLE daily_product_revenue
    OWNER TO retail_user;
```